import {ScrollView, StyleSheet, Text, View} from 'react-native';
import React from 'react';

export default function MorningDua() {
  return (
    <ScrollView>
      <View style={styles.duaCard}>
        <Text style={[styles.duaText]}>
          أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ، لَا
          إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ
          الْحَمْدُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ
          مَا فِي هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ
          شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ
          مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي
          النَّارِ وَعَذَابٍ فِي الْقَبْرِ.
        </Text>
      </View>

      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          اللَّهُمَّ بِكَ أَصْبَحْنَا وَبِكَ أَمْسَيْنَا وَبِكَ نَحْيَا وَبِكَ
          نَمُوتُ وَإِلَيْكَ الْمَصِيرُ
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          اللَّهُمَّ أَنْتَ رَبِّي لَا إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا
          عَبْدُكَ وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ
          بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ
          وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ
          إِلَّا أَنْتَ.
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          اللَّهُمَّ أَصْبَحْنَا نُشْهِدُكَ وَنُشْهِدُ حَمَلَةَ عَرْشِكَ
          وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ بِأَنَّكَ اللَّهُ لَا إِلٰهَ إِلَّا
          أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ
          وَرَسُولُكَ.
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي،
          اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلٰهَ إِلَّا أَنْتَ، اللَّهُمَّ
          إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي
          أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلٰهَ إِلَّا أَنْتَ.
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          حَسْبِيَ اللَّهُ لَا إِلٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ
          رَبُّ الْعَرْشِ الْعَظِيمِ.
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا
          وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ
          فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَا لِي، اللَّهُمَّ اسْتُرْ
          عَوْرَاتِي وَآمِنْ رَوْعَاتِي وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ
          خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِكَ
          أَنْ أُغْتَالَ مِنْ تَحْتِي.
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ
          وَالشَّهَادَةِ لَا إِلٰهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ
          وَمَلِيكَهُ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ
          وَشَرَكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجْرَّهُ إِلَى
          مُسْلِمٍ.
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ
          وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ.
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          رَضِيتُ بِاللَّهِ رَبًّا وَبِالإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ ، وَرِضَا نَفْسِهِ ،
          وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ . (3)
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          سُبْحَانَ اللَّهِ وَبِحَمْدِهِ . (100)
        </Text>
      </View>
      <View style={styles.duaCard}>
        <Text style={styles.duaText}>
          لَا إِلٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ
          وَلَهُ الْحَمْدُ، وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ. (100)
        </Text>
      </View>
      <View style={[styles.duaCard, styles.bottomCard]}>
        <Text style={styles.duaText}>
          أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ،
          اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ، فَتْحَهُ
          وَنَصْرَهُ وَنُورَهُ وَبَرَكَتَهُ وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ
          مَا فِيهِ وَشَرِّ مَا بَعْدَهُ
        </Text>
      </View>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  duaText: {
    fontFamily: 'Amiri-Regular', // Ensure that this matches the font name
    fontSize: 30,
    fontWeight: '100',
    writingDirection: 'rtl', // Right-to-left for Arabic text
    textAlign: 'right',
  },
  duaCard: {
    borderRadius: 10,
    padding: 10,
    margin: 15,
    backgroundColor: '#D4F7D3',
    shadowOffset: {width: 0, height: 4},
    shadowOpacity: 0.1,
    elevation: 10,
  },
  bottomCard: {
    marginBottom: 100,
  },
});
